{
  "recipes": [
    { "id": 1, "title": "Pasta Aglio e Olio", "cuisine": "Italian", "time": "20 min", "description": "A classic Roman pasta made with garlic, olive oil, and red pepper flakes. Simple yet deeply flavorful, this dish proves that great cooking does not need a long list of ingredients." },
    { "id": 2, "title": "Chicken Tikka Masala", "cuisine": "Indian", "time": "45 min", "description": "Tender chunks of marinated chicken simmered in a creamy tomato-based sauce with aromatic spices. A beloved dish that has become a staple in kitchens worldwide." },
    { "id": 3, "title": "Tacos Al Pastor", "cuisine": "Mexican", "time": "35 min", "description": "Marinated pork cooked with pineapple and served in warm corn tortillas. Inspired by Lebanese shawarma, this dish is a perfect example of culinary fusion." },
    { "id": 4, "title": "Miso Soup", "cuisine": "Japanese", "time": "15 min", "description": "A warm and comforting soup made with fermented soybean paste, tofu, and seaweed. It is a staple of Japanese home cooking served with nearly every meal." },
    { "id": 5, "title": "Caesar Salad", "cuisine": "American", "time": "15 min", "description": "Crisp romaine lettuce tossed with a creamy dressing made from anchovies, garlic, and parmesan. Invented in Tijuana, Mexico, despite its Italian-sounding name." },
    { "id": 6, "title": "Pad Thai", "cuisine": "Thai", "time": "30 min", "description": "Stir-fried rice noodles with shrimp, tofu, peanuts, and a tangy tamarind sauce. A street food favorite that balances sweet, sour, salty, and spicy in every bite." },
    { "id": 7, "title": "Beef Bourguignon", "cuisine": "French", "time": "3 hrs", "description": "A rich French stew of beef braised in red wine with carrots, onions, and mushrooms. Slow cooking transforms simple ingredients into something extraordinary." },
    { "id": 8, "title": "Sushi Rolls", "cuisine": "Japanese", "time": "45 min", "description": "Vinegared rice and fresh fish wrapped in seaweed. Making sushi at home is a fun and rewarding process once you get the hang of rolling." },
    { "id": 9, "title": "Greek Salad", "cuisine": "Greek", "time": "10 min", "description": "A refreshing mix of tomatoes, cucumbers, olives, red onion, and feta cheese dressed with olive oil and oregano. No lettuce needed in the traditional version." },
    { "id": 10, "title": "Butter Chicken", "cuisine": "Indian", "time": "40 min", "description": "Tender chicken pieces in a rich, buttery tomato cream sauce. Created in Delhi in the 1950s, it has become one of the most popular Indian dishes globally." },
    { "id": 11, "title": "Fish and Chips", "cuisine": "British", "time": "35 min", "description": "Battered and deep-fried fish served with thick-cut fries. A British classic best enjoyed with malt vinegar and mushy peas on the side." },
    { "id": 12, "title": "Ramen", "cuisine": "Japanese", "time": "4 hrs", "description": "A deeply flavored broth served with wheat noodles, sliced pork, soft-boiled egg, and various toppings. Each region of Japan has its own signature style." },
    { "id": 13, "title": "Falafel Wrap", "cuisine": "Middle Eastern", "time": "30 min", "description": "Crispy fried chickpea patties tucked into pita bread with tahini sauce, pickles, and fresh vegetables. A satisfying and protein-packed meal." },
    { "id": 14, "title": "Carbonara", "cuisine": "Italian", "time": "25 min", "description": "Pasta coated in a silky sauce made from eggs, pecorino cheese, and guanciale. The key is tossing everything together off the heat so the eggs thicken without scrambling." },
    { "id": 15, "title": "Bibimbap", "cuisine": "Korean", "time": "40 min", "description": "A colorful rice bowl topped with sauteed vegetables, meat, a fried egg, and spicy gochujang sauce. Mix everything together before eating for the best experience." },
    { "id": 16, "title": "Tom Yum Soup", "cuisine": "Thai", "time": "25 min", "description": "A hot and sour Thai soup loaded with shrimp, mushrooms, lemongrass, and lime. The fragrant broth hits every taste bud and clears the sinuses." },
    { "id": 17, "title": "Shakshuka", "cuisine": "Middle Eastern", "time": "30 min", "description": "Eggs poached in a spiced tomato and pepper sauce. Best served straight from the skillet with crusty bread for dipping into the runny yolks." },
    { "id": 18, "title": "Pho", "cuisine": "Vietnamese", "time": "2 hrs", "description": "A fragrant beef or chicken broth ladled over rice noodles and fresh herbs. The broth is everything here, built from charred onions, ginger, and whole spices." },
    { "id": 19, "title": "Paella", "cuisine": "Spanish", "time": "50 min", "description": "A saffron-infused rice dish cooked with seafood, chicken, and vegetables in a wide shallow pan. The crispy rice at the bottom, called socarrat, is the best part." },
    { "id": 20, "title": "Dumplings", "cuisine": "Chinese", "time": "1 hr", "description": "Thin dough wrappers filled with seasoned pork and vegetables, then steamed or pan-fried. Making them is a communal activity perfect for a weekend afternoon." },
    { "id": 21, "title": "Ceviche", "cuisine": "Peruvian", "time": "20 min", "description": "Fresh raw fish cured in citrus juices and mixed with onions, cilantro, and chili peppers. The acid from the lime effectively cooks the fish without heat." },
    { "id": 22, "title": "Bangers and Mash", "cuisine": "British", "time": "30 min", "description": "Pork sausages served over creamy mashed potatoes with onion gravy. A hearty pub classic that is the definition of comfort food." },
    { "id": 23, "title": "Enchiladas", "cuisine": "Mexican", "time": "40 min", "description": "Corn tortillas rolled around a filling and covered in chili sauce and cheese. They come out of the oven bubbling and irresistible." },
    { "id": 24, "title": "Laksa", "cuisine": "Malaysian", "time": "45 min", "description": "A spicy coconut curry soup with noodles, shrimp, and fresh herbs. The rich broth gets its complexity from a paste made with over a dozen ingredients." },
    { "id": 25, "title": "Moussaka", "cuisine": "Greek", "time": "1.5 hrs", "description": "Layers of eggplant, spiced meat sauce, and creamy bechamel baked until golden. Think of it as the Greek answer to lasagna." }
  ]
}
